src/Catalogs/рнсШаблонНабораДанных/рнсШаблонНабораДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рнсШаблонНабораДанных</name>
  <attributes>
    <name>ТипШаблона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоступныеЗначения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Реквизиты</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПараметра</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабличныеЧасти</name>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КолонкиТабличныхЧастей</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПараметра</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/рнсШаблонНабораДанных/Forms/ФормаПараметраШаблона/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДанныеПараметра = Новый Структура;
	ДанныеПараметра.Вставить("ИмяТабличнойЧасти");
	ДанныеПараметра.Вставить("ТипПараметра");
	ДанныеПараметра.Вставить("СписокЗначений");
	ДанныеПараметра.Вставить("ИмяПараметра");
	ДанныеПараметра.Вставить("ЗначениеПоУмолчанию");
	ДанныеПараметра.Вставить("Описание");
	
	ЗаполнитьЗначенияСвойств(ДанныеПараметра, Параметры);
	
	Если ЗначениеЗаполнено(ДанныеПараметра.ИмяТабличнойЧасти) Тогда
		Заголовок = СтрШаблон(НСтр("ru = 'Реквизит таблицы %1'"), ДанныеПараметра.ИмяТабличнойЧасти);
	Иначе
		Заголовок = НСтр("ru = 'Реквизит шапки'");	
	КонецЕсли; 	
		
	ТипПараметра.ЗагрузитьЗначения(ДанныеПараметра.ТипПараметра);
	СписокЗначенийПараметра.ЗагрузитьЗначения(ДанныеПараметра.СписокЗначений); 
	
	УстановитьОграничениеВыбора(); 
	
	ИмяПараметра 		= ДанныеПараметра.ИмяПараметра;
	ЗначениеПоУмолчанию = ДанныеПараметра.ЗначениеПоУмолчанию; 
	Описание 			= ДанныеПараметра.Описание;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипПараметраНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	          	
	СтандартнаяОбработка 	= Ложь;
	ПараметрыВыбораТипа 	= Новый Структура("ТипДанныхВыбора, ТипРезультата, Отмеченные", 2, 0, ТипПараметра); 
	Оповещение 				= Новый ОписаниеОповещения("ВыборТипа_Завершение", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.рнсФормаВыбораОбъектовМетаданных", ПараметрыВыбораТипа, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	  	
КонецПроцедуры     

&НаКлиенте
Процедура ТипПараметраОчистка(Элемент, СтандартнаяОбработка)
	
	УстановитьОграничениеВыбора();	
	
КонецПроцедуры 

&НаКлиенте
Процедура СписокЗначенийПараметраПриИзменении(Элемент)
	
	УстановитьОграничениеВыбора();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подтвердить(Команда)

	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ИмяПараметра", ИмяПараметра); 
	ПараметрыЗаполнения.Вставить("ТипПараметра", ТипПараметра.ВыгрузитьЗначения());
	ПараметрыЗаполнения.Вставить("ЗначениеПоУмолчанию", ЗначениеПоУмолчанию);
	ПараметрыЗаполнения.Вставить("СписокЗначений", СписокЗначенийПараметра.ВыгрузитьЗначения()); 
	ПараметрыЗаполнения.Вставить("Описание", Описание);
	
	Закрыть(ПараметрыЗаполнения);
	
КонецПроцедуры  

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборТипа_Завершение(Результат, ДополнительныеПараметры) Экспорт

	Если ЗначениеЗаполнено(Результат) Тогда 	
		
		ТипПараметра.ЗагрузитьЗначения(Результат); 
		
		УстановитьОграничениеВыбора();	
		
	КонецЕсли;	
	
КонецПроцедуры  

&НаСервере
Процедура УстановитьОграничениеВыбора()
	
	Если ЗначениеЗаполнено(ТипПараметра) Тогда
		
		МассивВыбранныхТипов = Новый Массив;
		Для каждого Ит Из ТипПараметра Цикл
			МассивВыбранныхТипов.Добавить(Тип(Ит));	
		КонецЦикла;	
		
		ТипыПараметра = Новый ОписаниеТипов(МассивВыбранныхТипов); 
		
	Иначе
		
		ТипыПараметра = Новый ОписаниеТипов; 
		
		СписокЗначенийПараметра.Очистить(); 
		
	КонецЕсли; 	
	 		
	Элементы.ЗначениеПоУмолчанию.ОграничениеТипа 	= ТипыПараметра;
	СписокЗначенийПараметра.ТипЗначения 			= ТипыПараметра;	
	
	Если ЗначениеЗаполнено(СписокЗначенийПараметра) Тогда
		Элементы.ЗначениеПоУмолчанию.РежимВыбораИзСписка = Истина;
		Элементы.ЗначениеПоУмолчанию.СписокВыбора.ЗагрузитьЗначения(СписокЗначенийПараметра.ВыгрузитьЗначения());		
	Иначе         
		ЗначениеПоУмолчанию	= Неопределено;
		Элементы.ЗначениеПоУмолчанию.РежимВыбораИзСписка = Ложь;
		Элементы.ЗначениеПоУмолчанию.СписокВыбора.Очистить();	
	КонецЕсли;  
	
КонецПроцедуры   

#КонецОбласти
